import React, { useState } from 'react'
import { Segment, TextArea, Checkbox, Button } from 'semantic-ui-react'
import { SegmentTitle } from '../../elements/SegmentTitle'
import { getExaminationDateFormat } from './utils'

export default function ExaminationContainer({ data }) {
  const { name, description, startAt, endAt } = data
  const [isEnterExamRoom, setIsEnterExamRoom] = useState(false)
  const [isAgreeTerm, setIsAgreeTerm] = useState(false)
  if (!isEnterExamRoom) {
    return (
      <Segment className='p-5'>
        <SegmentTitle className='mt-2'>{name}</SegmentTitle>
        <p className='my-3'>
          <strong>รายละเอียดของข้อสอบ </strong>
          {description}
        </p>
        <strong>เริ่มสอบ{getExaminationDateFormat(startAt, endAt)}</strong>
        <textarea className='w-100 my-3' rows={12} readOnly>
          ซัดดัมร้อยเอ็ดราชลัญจกร รามาวตารคลื่นเหียนลากข้างเบญกายสีหโมนี
          มโนกรรมกระบี่ คนใช้ไลบีเรียเนชั่นมอนแทนา
          ลำปางเพชรบุรีคลื่นเหียนเบลเยียม ล้านช้าง เนคเทค ปทุมธานีพัทลุง
          โตเบโกโรเบิร์ตชื่อรอง นิด้าอิทธิฤทธิ์หนักข้อ
          ดีทรอยต์แม่ฮ่องสอนสตอกโฮล์ม อินทราทิตย์กล้ำกรายเทพรัตนน้ำคร่ำนาลันทา
          ร้อยละพระคุณ ดีแทครัสปูตินยาใจโฮจิมินห์นิสสัน
          ชื่อรองเบียดเสียดนครราชสีมาตากโนเกีย เอลซัลวาดอร์อุบลราชธานีสง่างาม
          ทรูมูฟยูเครนดอนเมือง บูร์กินาฟาโซ อะเมซอน
          นครศรีธรรมราชเติร์กยูเนสโกโคตรบูรณ์ปทุมธานี รัตติกาลดีแทค โฮปเวลล์
          ปิดฉากแมวเซายูทาห์ธรรมชาติ ศรีสะเกษออริกอนโลซานน์เมล์อากาศ
          เบนซ์เคย์แมนลินคอล์น เวเนซุเอลา ประชาสัมพันธ์พิษณุโลกเจมส์ดินดำนักบุญ
          แก่แดดองคุลิมาลจิว ยะลาเปอร์เซียชื่นชม
          คูโบต้าเมามายอายุวัฒนะชัยภูมิไอน์สไตน์ นครพนมเนเธอร์แลนด์คาบูลอีตัว
          ระนอง ราชบุรีมารวิชัยลำปางเลือกสรร หนักข้อธากา
          ฟรังซิสเอสโตเนียข้าวสารเวชภัณฑ์พารากอน
          ปะลิสมุสโสลินีวิทยายนกาลิเลโอสาปส่ง เอลซัลวาดอร์บังคลาเทศ อั้มนิโคลัส
          ต่อกรนิด้าอดุลยเดชอัลคาเทลแม่กอง ชาด โมนาโค
          เบรุตเบญกายแปรผันบวงสรวงโบตัน หริภุญชัย
          สาวัตถีกรือเซะอะแลสกาบรัดเลย์วิกตอเรีย ราเมศวรซาราเยโวโลซานน์
          ขอนแก่นเนชันแนลรัสเซียน ฟรานซิส แอคคอร์ดอ่างทองพนมเปญกาฐมาณฑุคมคาย
          เช็กแมกซ์เวลล์เบนินยามาฮ่าฟิจิ ปทุมธานีพระเครื่องเฮนรี่อีเจียน
          เบลีซผีทะเล กุมภกรรณตะนาวศรีลำพูนเคย์แมนบรัดเลย์ หนุมานยะไข่ขี้คร้าน
          ระนอง ปอเต็กตึ๊งเฮนรีประชาสัมพันธ์เนชั่นแนลเบลีซ จอร์เจียเอกทัศน์
          กุมภกรรณ พอควรกรีซราเมศวรอาเซม จำปาศักดิ์ฟองเต้าหู้มาเลเซีย
          ไม้ไต่คู้หาวนอนตกหล่นจิมกล้ำกราย ศรีสะเกษฟองเต้าหู้ถูกชะตาเบลเยียม
          ยาเวห์สง่างามพัทลุง ยูไล แวดวงธรรมชาติเป้ย ภูฏานฟิลิปส์นาอูรูสาวัตถี
          คลื่นเหียนซัมซุง เม้งมอลตา บรู๊ซมุมไบหนังเรียด สารนาถแม่เจ้าแปซิฟิก
          แอ๋วแอคคอร์ดบายศรีจำปาศักดิ์ แมกซ์เวลล์ปัตตานี ซีเรียวิดพื้นธากา
          ตากหยาบหยามเจมส์เนวินธรณีวิทยา ฮอนโนลูลูพลาโต
          สแตนฟอร์ดอาบูดาบีเทพสังหรณ์เจมส์แก้ขัด ต้นแบบสดกก๊อกธมปายปารุสก์
          โมนาโกเติร์กเมนิสถานไอโอวาไทรบุรีตลบตะแลง ดอกสร้อยสวิส
          ตกหล่นโอลิมเปียยูนิเซฟฉงชิ่ง กลางคันมาดริด
        </textarea>
        <div className='d-flex justify-content-between'>
          <Checkbox
            label='ยอมรับข้อตกลงและกฏระเบียบการสอบ'
            onChange={() => setIsAgreeTerm(!isAgreeTerm)}
          />
          <Button
            color='orange'
            disabled={!isAgreeTerm}
            onClick={() => setIsEnterExamRoom(true)}
          >
            เข้าห้องสอบ
          </Button>
        </div>
      </Segment>
    )
  }
  return null
}
